In [18]:
import pandas as pd

In [19]:
dataset = pd.read_csv("Student.csv")
dataset.head()

    Name  Roll No   Age  Marks
0  Zaid       1.0  20.0   75.0
1   Zaki      2.0  20.0    NaN
2  Priya      3.0  20.0   80.0
3  Rahul      4.0   NaN   65.0
4   Neha      NaN  19.0   67.0

In [20]:
dataset.isnull().sum()

Name       0
Roll No    2
Age        3
Marks      3
dtype: int64

In [21]:
dataset["Age"].mode()[0]

np.float64(20.0)

In [22]:
dataset["Marks"] = dataset["Marks"].fillna(dataset["Marks"].mean())
dataset["Age"] = dataset["Age"].fillna(dataset["Age"].mode()[0])

In [25]:
dataset.dropna(inplace=True)

In [26]:
dataset.isnull().sum()

Name       0
Roll No    0
Age        0
Marks      0
dtype: int64

In [28]:
filtered = dataset[dataset["Marks"]>74]
print("above 74 marks Students\n",filtered)

above 74 marks Students
      Name  Roll No   Age  Marks
0   Zaid       1.0  20.0   75.0
2   Priya      3.0  20.0   80.0
6   Aqdas      7.0  20.0   85.0
11    Jay     12.0  19.0   78.0